In [1]:
import pandas as pd
import sqlite3

In [2]:
dMovieGross ('../unzippedData/im.db')

In [3]:
! ls ../unzippedData

bom.movie_gross.csv  rt.movie_info.tsv    tmdb.movies.csv
im.db                rt.reviews.tsv       tn.movie_budgets.csv

In [6]:
# Function for Cleaning Column headers

def clean_column_headers(dataframe):
    dataframe.columns = dataframe.columns.str.title()
    dataframe.columns = dataframe.columns.str.replace("_", " ")bom.movie_gross.csv

In [7]:
# Function for cleaning comma seperated string values of a series into list of strings. Accepts one series.

def clean_comma_series(Series):
    Series = Series.str.replace("_", " ")
    Series = Series.str.title()
    Series = Series.str.split(",")
    return Series

In [4]:
cursor = conn.cursor()

![Image of ERD Diagram IMDB](https://raw.githubusercontent.com/learn-co-curriculum/dsc-phase-2-project-v3/main/movie_data_erd.jpeg)

In [5]:
# displaying table

imdb_query = """ 
    SELECT *
    FROM sqlite_master
"""
imdb_df = pd.read_sql(imdb_query, conn)
imdb_df

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [26]:
# Connecting to Persons Table

persons_query = """ 
    SELECT *
    FROM persons
"""

persons_df = pd.read_sql(persons_query, conn)

# Data Cleaning

clean_column_headers(persons_df)
persons_df['Primary Profession'] = clean_comma_series(persons_df['Primary Profession'])
persons_df.drop(persons_df[persons_df['Death Year'].isna()==False].index, inplace=True)
persons_df.drop(persons_df[persons_df['Birth Year']<1930].index, inplace=True)
persons_df

,Person Id,Primary Name,Birth Year,Death Year,Primary Profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"[Miscellaneous, Production Manager, Producer]"
1,nm0061865,Joseph Bauer,NaN,NaN,"[Composer, Music Department, Sound Department]"
2,nm0062070,Bruce Baum,NaN,NaN,"[Miscellaneous, Actor, Writer]"
3,nm0062195,Axel Baumann,NaN,NaN,"[Camera Department, Cinematographer, Art Depar..."
4,nm0062798,Pete Baxter,NaN,NaN,"[Production Designer, Art Department, Set Deco..."
...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,[Actress]
606644,nm9990690,Joo Yeon So,NaN,NaN,[Actress]
606645,nm9991320,Madeline Smith,NaN,NaN,[Actress]
606646,nm9991786,Michelle Modigliani,NaN,NaN,[Producer]
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"[Director, Actor, Writer]"

In [12]:
# Connecting to Principals Table

principals_query = """ 
    SELECT *
    FROM principals
"""

principals_df = pd.read_sql(principals_query, conn)
clean_column_headers(principals_df)

principals_df.head()

    Movie Id  Ordering  Person Id  Category       Job        Characters
0  tt0111414         1  nm0246005     actor      None       ["The Man"]
1  tt0111414         2  nm0398271  director      None              None
2  tt0111414         3  nm3739909  producer  producer              None
3  tt0323808        10  nm0059247    editor      None              None
4  tt0323808         1  nm3579312   actress      None  ["Beth Boothby"]

In [13]:
# Connecting to Known_For Table

known_for_query = """ 
    SELECT *
    FROM known_for
"""

known_for_df = pd.read_sql(known_for_query, conn)
clean_column_headers(known_for_df)

known_for_df.head()

   Person Id   Movie Id
0  nm0061671  tt0837562
1  nm0061671  tt2398241
2  nm0061671  tt0844471
3  nm0061671  tt0118553
4  nm0061865  tt0896534

In [14]:
# Connecting to Movie Basics Table

movie_basics_query = """ 
    SELECT *
    FROM movie_basics
"""

movie_basics_df = pd.read_sql(movie_basics_query, conn)
clean_column_headers(movie_basics_df)

movie_basics_df.head()

,Movie Id,Primary Title,Original Title,Start Year,Runtime Minutes,Genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [15]:
# Connecting to Movie Ratings Table

movie_ratings_query = """ 
    SELECT *
    FROM movie_ratings
"""
movie_ratings_df = pd.read_sql(movie_ratings_query, conn)
clean_column_headers(movie_ratings_df)

movie_ratings_df

         Movie Id  Averagerating  Numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [9]:
persons_df['Death Year'].value_counts()

2018.0    624
2017.0    621
2016.0    592
2015.0    540
2013.0    437
         ...
17.0        1
1673.0      1
1703.0      1
1846.0      1
1854.0      1
Name: Death Year, Length: 214, dtype: int64

In [21]:
# dropping dead people. no pun intended
persons_df.drop(persons_df[persons_df['Death Year'].isna()==False].index, inplace=True)
persons_df

,Person Id,Primary Name,Birth Year,Death Year,Primary Profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"[Miscellaneous, Production Manager, Producer]"
1,nm0061865,Joseph Bauer,NaN,NaN,"[Composer, Music Department, Sound Department]"
2,nm0062070,Bruce Baum,NaN,NaN,"[Miscellaneous, Actor, Writer]"
3,nm0062195,Axel Baumann,NaN,NaN,"[Camera Department, Cinematographer, Art Depar..."
4,nm0062798,Pete Baxter,NaN,NaN,"[Production Designer, Art Department, Set Deco..."
...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,[Actress]
606644,nm9990690,Joo Yeon So,NaN,NaN,[Actress]
606645,nm9991320,Madeline Smith,NaN,NaN,[Actress]
606646,nm9991786,Michelle Modigliani,NaN,NaN,[Producer]
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"[Director, Actor, Writer]"

In [16]:
# Connecting to Movie Akas Table

movie_akas_query = """ 
    SELECT *
    FROM movie_akas
"""
movie_akas_df = pd.read_sql(movie_akas_query, conn)
clean_column_headers(movie_akas_df)

In [17]:
# Make function to clean up column names
    # Title
    # Change underscore to space
    # In place

In [18]:
# Make function to split up comma seperated values to become a set or list
    # will help easily do IN

In [19]:
# profitability
# ratings * number_of_people